Qie-Zi-888/Multi_functionalMenu/libraries/at32f435_437_board/at32f435_437_board_lcd.c
/**
  **************************************************************************
  * @file     at_surf_f437_board_lcd.c
  * @version  v2.0.0
  * @date     2020-11-02
  * @brief    set of firmware functions to manage leds and push-button.
  *           initialize delay function.
  **************************************************************************
  *                       Copyright notice & Disclaimer
  *
  * The software Board Support Package (BSP) that is made available to 
  * download from Artery official website is the copyrighted work of Artery. 
  * Artery authorizes customers to use, copy, and distribute the BSP 
  * software and its related documentation for the purpose of design and 
  * development in conjunction with Artery microcontrollers. Use of the 
  * software is governed by this copyright notice and the following disclaimer.
  *
  * THIS SOFTWARE IS PROVIDED ON "AS IS" BASIS WITHOUT WARRANTIES, 
  * GUARANTEES OR REPRESENTATIONS OF ANY KIND. ARTERY EXPRESSLY DISCLAIMS, 
  * TO THE FULLEST EXTENT PERMITTED BY LAW, ALL EXPRESS, IMPLIED OR
  * STATUTORY OR OTHER WARRANTIES, GUARANTEES OR REPRESENTATIONS, 
  * INCLUDING BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY, 
  * FITNESS FOR A PARTICULAR PURPOSE, OR NON-INFRINGEMENT.
  *
  **************************************************************************
  */

#include "at32f435_437_board_lcd.h"
#include "at32f435_437_board_delay.h"
#include "at32f435_437_board_font.h"

lcd_device_type lcddev;

/**
  * @brief  configures the xmc and gpios to interface with the lcd.
  *         this function must be called before any write/read operation
  *         on the lcd.
  * @param  none 
  * @retval none
  */
void xmc_init(void)
{
 
  gpio_init_type  gpio_init_struct = {0};
  xmc_norsram_init_type  xmc_norsram_init_struct;
  xmc_norsram_timing_init_type rw_timing_struct, w_timing_struct;

  /* enable the gpio clock */
  crm_periph_clock_enable(LCD_D0_GPIO_CLK,  TRUE);
  crm_periph_clock_enable(LCD_D1_GPIO_CLK,  TRUE);
  crm_periph_clock_enable(LCD_D2_GPIO_CLK,  TRUE);
  crm_periph_clock_enable(LCD_D3_GPIO_CLK,  TRUE); 
  crm_periph_clock_enable(LCD_D4_GPIO_CLK,  TRUE);
  crm_periph_clock_enable(LCD_D5_GPIO_CLK,  TRUE);
  crm_periph_clock_enable(LCD_D6_GPIO_CLK,  TRUE);
  crm_periph_clock_enable(LCD_D7_GPIO_CLK,  TRUE);
  crm_periph_clock_enable(LCD_D8_GPIO_CLK,  TRUE); 
  crm_periph_clock_enable(LCD_D9_GPIO_CLK,  TRUE);
  crm_periph_clock_enable(LCD_D10_GPIO_CLK, TRUE);
  crm_periph_clock_enable(LCD_D11_GPIO_CLK, TRUE);
  crm_periph_clock_enable(LCD_D12_GPIO_CLK, TRUE);
  crm_periph_clock_enable(LCD_D13_GPIO_CLK, TRUE); 
  crm_periph_clock_enable(LCD_D14_GPIO_CLK, TRUE);
  crm_periph_clock_enable(LCD_D15_GPIO_CLK, TRUE);
  crm_periph_clock_enable(LCD_NE1_GPIO_CLK, TRUE);
  crm_periph_clock_enable(LCD_NWE_GPIO_CLK, TRUE);
  crm_periph_clock_enable(LCD_NOE_GPIO_CLK, TRUE); 
  crm_periph_clock_enable(LCD_A16_GPIO_CLK,  TRUE);

  /* enable the xmc clock */
  crm_periph_clock_enable(CRM_XMC_PERIPH_CLOCK, TRUE);
  
  /*-- gpio configuration ------------------------------------------------------*/
  gpio_pin_mux_config(LCD_D0_GPIO_PORT,  LCD_D0_GPIO_PINS_SOURCE,  LCD_D0_GPIO_MUX); 
  gpio_pin_mux_config(LCD_D1_GPIO_PORT,  LCD_D1_GPIO_PINS_SOURCE,  LCD_D1_GPIO_MUX); 
  gpio_pin_mux_config(LCD_D2_GPIO_PORT,  LCD_D2_GPIO_PINS_SOURCE,  LCD_D2_GPIO_MUX); 
  gpio_pin_mux_config(LCD_D3_GPIO_PORT,  LCD_D3_GPIO_PINS_SOURCE,  LCD_D3_GPIO_MUX); 
  gpio_pin_mux_config(LCD_D4_GPIO_PORT,  LCD_D4_GPIO_PINS_SOURCE,  LCD_D4_GPIO_MUX); 
  gpio_pin_mux_config(LCD_D5_GPIO_PORT,  LCD_D5_GPIO_PINS_SOURCE,  LCD_D5_GPIO_MUX); 
  gpio_pin_mux_config(LCD_D6_GPIO_PORT,  LCD_D6_GPIO_PINS_SOURCE,  LCD_D6_GPIO_MUX); 
  gpio_pin_mux_config(LCD_D7_GPIO_PORT,  LCD_D7_GPIO_PINS_SOURCE,  LCD_D7_GPIO_MUX); 
  gpio_pin_mux_config(LCD_D8_GPIO_PORT,  LCD_D8_GPIO_PINS_SOURCE,  LCD_D8_GPIO_MUX); 
  gpio_pin_mux_config(LCD_D9_GPIO_PORT,  LCD_D9_GPIO_PINS_SOURCE,  LCD_D9_GPIO_MUX); 
  gpio_pin_mux_config(LCD_D10_GPIO_PORT, LCD_D10_GPIO_PINS_SOURCE, LCD_D10_GPIO_MUX);
  gpio_pin_mux_config(LCD_D11_GPIO_PORT, LCD_D11_GPIO_PINS_SOURCE, LCD_D11_GPIO_MUX);
  gpio_pin_mux_config(LCD_D12_GPIO_PORT, LCD_D12_GPIO_PINS_SOURCE, LCD_D12_GPIO_MUX);
  gpio_pin_mux_config(LCD_D13_GPIO_PORT, LCD_D13_GPIO_PINS_SOURCE, LCD_D13_GPIO_MUX);
  gpio_pin_mux_config(LCD_D14_GPIO_PORT, LCD_D14_GPIO_PINS_SOURCE, LCD_D14_GPIO_MUX);
  gpio_pin_mux_config(LCD_D15_GPIO_PORT, LCD_D15_GPIO_PINS_SOURCE, LCD_D15_GPIO_MUX);
  gpio_pin_mux_config(LCD_NE1_GPIO_PORT, LCD_NE1_GPIO_PINS_SOURCE, LCD_NE1_GPIO_MUX);
  gpio_pin_mux_config(LCD_NWE_GPIO_PORT, LCD_NWE_GPIO_PINS_SOURCE, LCD_NWE_GPIO_MUX);
  gpio_pin_mux_config(LCD_NOE_GPIO_PORT, LCD_NOE_GPIO_PINS_SOURCE, LCD_NOE_GPIO_MUX);  
  gpio_pin_mux_config(LCD_A16_GPIO_PORT,  LCD_A16_GPIO_PINS_SOURCE, LCD_A16_GPIO_MUX); 
    
  /* lcd data lines configuration */  
  gpio_init_struct.gpio_mode = GPIO_MODE_MUX;
  gpio_init_struct.gpio_out_type = GPIO_OUTPUT_PUSH_PULL;
  gpio_init_struct.gpio_pull = GPIO_PULL_NONE;
  gpio_init_struct.gpio_drive_strength = GPIO_DRIVE_STRENGTH_STRONGER;
  
  gpio_init_struct.gpio_pins = LCD_D0_GPIO_PIN;
  gpio_init(LCD_D0_GPIO_PORT,  &gpio_init_struct);

  gpio_init_struct.gpio_pins = LCD_D1_GPIO_PIN;
  gpio_init(LCD_D1_GPIO_PORT,  &gpio_init_struct);

  gpio_init_struct.gpio_pins = LCD_D2_GPIO_PIN;
  gpio_init(LCD_D2_GPIO_PORT,  &gpio_init_struct);

  gpio_init_struct.gpio_pins = LCD_D3_GPIO_PIN;
  gpio_init(LCD_D3_GPIO_PORT,  &gpio_init_struct);

  gpio_init_struct.gpio_pins = LCD_D4_GPIO_PIN;
  gpio_init(LCD_D4_GPIO_PORT,  &gpio_init_struct);

  gpio_init_struct.gpio_pins = LCD_D5_GPIO_PIN;
  gpio_init(LCD_D5_GPIO_PORT,  &gpio_init_struct);

  gpio_init_struct.gpio_pins = LCD_D6_GPIO_PIN;
  gpio_init(LCD_D6_GPIO_PORT,  &gpio_init_struct);

  gpio_init_struct.gpio_pins = LCD_D7_GPIO_PIN;
  gpio_init(LCD_D7_GPIO_PORT,  &gpio_init_struct);

  gpio_init_struct.gpio_pins = LCD_D8_GPIO_PIN;
  gpio_init(LCD_D8_GPIO_PORT,  &gpio_init_struct);

  gpio_init_struct.gpio_pins = LCD_D9_GPIO_PIN;
  gpio_init(LCD_D9_GPIO_PORT,  &gpio_init_struct);

  gpio_init_struct.gpio_pins = LCD_D10_GPIO_PIN;
  gpio_init(LCD_D10_GPIO_PORT, &gpio_init_struct);

  gpio_init_struct.gpio_pins = LCD_D11_GPIO_PIN;
  gpio_init(LCD_D11_GPIO_PORT, &gpio_init_struct);

  gpio_init_struct.gpio_pins = LCD_D12_GPIO_PIN;
  gpio_init(LCD_D12_GPIO_PORT, &gpio_init_struct);

  gpio_init_struct.gpio_pins = LCD_D13_GPIO_PIN;
  gpio_init(LCD_D13_GPIO_PORT, &gpio_init_struct);

