Qie-Zi-888/Multi_functionalMenu/libraries/at32f435_437_board/at32f435_437_board_lcd.c
  gpio_init_struct.gpio_pins = LCD_D14_GPIO_PIN;
  gpio_init(LCD_D14_GPIO_PORT, &gpio_init_struct);

  gpio_init_struct.gpio_pins = LCD_D15_GPIO_PIN;
  gpio_init(LCD_D15_GPIO_PORT, &gpio_init_struct);

  gpio_init_struct.gpio_pins = LCD_NE1_GPIO_PIN;
  gpio_init(LCD_NE1_GPIO_PORT, &gpio_init_struct);

  gpio_init_struct.gpio_pins = LCD_NWE_GPIO_PIN;
  gpio_init(LCD_NWE_GPIO_PORT, &gpio_init_struct);

  gpio_init_struct.gpio_pins = LCD_NOE_GPIO_PIN;
  gpio_init(LCD_NOE_GPIO_PORT, &gpio_init_struct);

  gpio_init_struct.gpio_pins = LCD_A16_GPIO_PIN;
  gpio_init(LCD_A16_GPIO_PORT,  &gpio_init_struct);
  
	
  /* lcd BL  configuration */
  gpio_init_struct.gpio_pins = LCD_BL_GPIO_PIN;
  gpio_init_struct.gpio_mode = GPIO_MODE_OUTPUT;
  gpio_init_struct.gpio_out_type = GPIO_OUTPUT_PUSH_PULL;
  gpio_init_struct.gpio_pull = GPIO_PULL_NONE;
  gpio_init_struct.gpio_drive_strength = GPIO_DRIVE_STRENGTH_STRONGER;
  gpio_init(LCD_BL_GPIO_PORT, &gpio_init_struct);

  /* lcd rst  configuration */
  gpio_init_struct.gpio_pins = LCD_RESET_GPIO_PIN;
  gpio_init_struct.gpio_mode = GPIO_MODE_OUTPUT;
  gpio_init_struct.gpio_out_type = GPIO_OUTPUT_PUSH_PULL;
  gpio_init_struct.gpio_pull = GPIO_PULL_NONE;
  gpio_init_struct.gpio_drive_strength = GPIO_DRIVE_STRENGTH_STRONGER;
  gpio_init(LCD_RESET_GPIO_PORT, &gpio_init_struct);
  
  /*-- xmc configuration ------------------------------------------------------*/
  xmc_norsram_default_para_init(&xmc_norsram_init_struct);
  xmc_norsram_init_struct.subbank = XMC_BANK1_NOR_SRAM1;
  xmc_norsram_init_struct.data_addr_multiplex = XMC_DATA_ADDR_MUX_DISABLE;
  xmc_norsram_init_struct.device = XMC_DEVICE_SRAM;
  xmc_norsram_init_struct.bus_type = XMC_BUSTYPE_16_BITS;
  xmc_norsram_init_struct.burst_mode_enable = XMC_BURST_MODE_DISABLE;
  xmc_norsram_init_struct.asynwait_enable = XMC_ASYN_WAIT_DISABLE;
  xmc_norsram_init_struct.wait_signal_lv = XMC_WAIT_SIGNAL_LEVEL_LOW;
  xmc_norsram_init_struct.wrapped_mode_enable = XMC_WRAPPED_MODE_DISABLE;
  xmc_norsram_init_struct.wait_signal_config = XMC_WAIT_SIGNAL_SYN_BEFORE;
  xmc_norsram_init_struct.write_enable = XMC_WRITE_OPERATION_ENABLE;
  xmc_norsram_init_struct.wait_signal_enable = XMC_WAIT_SIGNAL_DISABLE;
  xmc_norsram_init_struct.write_timing_enable = XMC_WRITE_TIMING_ENABLE;
  xmc_norsram_init_struct.write_burst_syn = XMC_WRITE_BURST_SYN_DISABLE;
  xmc_nor_sram_init(&xmc_norsram_init_struct);
  
  /* timing configuration */
  xmc_norsram_timing_default_para_init(&rw_timing_struct, &w_timing_struct);
  rw_timing_struct.subbank = XMC_BANK1_NOR_SRAM1;
  rw_timing_struct.write_timing_enable = XMC_WRITE_TIMING_ENABLE;
  rw_timing_struct.addr_setup_time = 0x2;
  rw_timing_struct.addr_hold_time = 0x0;
  rw_timing_struct.data_setup_time = 0x2;
  rw_timing_struct.bus_latency_time = 0x0;
  rw_timing_struct.clk_psc = 0x0;
  rw_timing_struct.data_latency_time = 0x0;
  rw_timing_struct.mode = XMC_ACCESS_MODE_A;
  w_timing_struct.subbank = XMC_BANK1_NOR_SRAM1;
  w_timing_struct.write_timing_enable = XMC_WRITE_TIMING_ENABLE;
  w_timing_struct.addr_setup_time = 0x2;
  w_timing_struct.addr_hold_time = 0x0;
  w_timing_struct.data_setup_time = 0x2;
  w_timing_struct.bus_latency_time = 0x0;
  w_timing_struct.clk_psc = 0x0;
  w_timing_struct.data_latency_time = 0x0;
  w_timing_struct.mode = XMC_ACCESS_MODE_A;  
  xmc_nor_sram_timing_config(&rw_timing_struct, &w_timing_struct);
  
  xmc_ext_timing_config(XMC_BANK1_NOR_SRAM1, 0, 0); 
  /* enable xmc_bank1_nor_sram4 */
  xmc_nor_sram_enable(XMC_BANK1_NOR_SRAM1, TRUE);
  
}

/**
  * @brief  lcd data read
  * @param  none
  * @retval data
  */
uint16_t lcd_read(void)
{
  uint16_t data;  
  
  data = *(__IO uint16_t*)XMC_LCD_DATA;
  
  return data;  
}

/**
  * @brief  write an 16-bit command to the lcd screen
  * @param  data:command value to be written
  * @retval none
  */
void lcd_reg_write(uint16_t data)
{ 
  *(__IO uint16_t*) XMC_LCD_COMMAND = data;
}

/**
  * @brief  write an 16-bit data to the lcd screen
  * @param  data:data value to be written
  * @retval none
  */
void lcd_data_write(uint16_t data)
{
  *(__IO uint16_t*) XMC_LCD_DATA = data;
}

/**
  * @brief  read an 16-bit value from the lcd screen
  * @param  none
  * @retval read value
  */
uint16_t lcd_data_read(void)
{
  return lcd_read();
}

/**
  * @brief  write data into registers
  * @param  lcd_reg: register address 
  * @param  lcd_regvalue: data to be written
  * @retval none
  */
void lcd_command_write(uint16_t lcd_comm, uint16_t lcd_regvalue)
{    
  *(__IO uint16_t*) XMC_LCD_COMMAND = lcd_comm;  
  *(__IO uint16_t*) XMC_LCD_DATA = lcd_regvalue; 
}     

/**
  * @brief  read value from specially registers
  * @param  lcd_reg:register address
  * @retval read value
  */
void lcd_command_read(uint16_t lcd_comm, uint8_t *rval, int32_t n)
{
  lcd_reg_write(lcd_comm); 
  
  while(n--)
  {    
    *(rval++) = lcd_data_read();
  }
}

/**
  * @brief  write gram
  * @param  none
  * @retval none
  */
void lcd_ram_prepare_write(void)
{
  lcd_reg_write(lcddev.wramcmd);
}   

/**
  * @brief  read gram
  * @param  none
  * @retval none
  */ 
void lcd_ram_prepare_read(void)
{
  lcd_reg_write(lcddev.rramcmd);
}

/**
  * @brief  write an 16-bit command to the lcd screen
  * @param  data:data to be written
  * @retval none
  */ 
void lcd_data_16bit_write(uint16_t data)
{
  #if LCD_USE8BIT_MODEL  
  LCD->LCD_RAM = data >> 8;
  LCD->LCD_RAM = data;
  #else
  *(__IO uint16_t*) XMC_LCD_DATA = data;
  #endif
}

/** 
  * @brief  transform rgb format to 565
  * @param  red: color red
  * @param  green: color green
  * @param  blue: color blue
  * @retval none
  */   
uint16_t color_to_565(uint8_t red, uint8_t green, uint8_t blue)
{
  return ((red & 0xF8) << 8) | ((green & 0xFC) << 3) | ((blue & 0xF8) >> 3);
}

/** 
  * @brief  read an 16-bit value from the lcd screen
  * @param  none
  * @retval read value
  */
uint16_t lcd_data_16bit_read(void)
{
  uint16_t r, g, b;

  r = lcd_data_read();
  delay_us(1);
  
  r = lcd_data_read();
  delay_us(1);
  
