Qie-Zi-888/Multi_functionalMenu/libraries/at32f435_437_board/at32f435_437_board_lcd.c
  g = lcd_data_read();
  
#if LCD_USE8BIT_MODEL
  delay_us(1);
  b = lcd_data_read();
#else  
  b = g >> 8;
  g = r & 0xFF; 
  r = r >> 8;
#endif
  
  return color_to_565(r, g, b);
}

/**
  * @brief  write a pixel data at a specified location
  * @param  x:the x coordinate of the pixel 
  * @param  y:the y coordinate of the pixel
  * @param  color:the color of the pixel 
  * @retval none
  */
void lcd_point_draw(uint16_t x, uint16_t y, uint16_t color)
{
  lcd_cursor_set(x, y);
  lcd_data_16bit_write(color); 
}

/**
  * @brief  draw a line at a specified location
  * @param  x_start:the x start coordinate of the line 
  * @param  x_end  :the x end   coordinate of the line 
  * @param  y_start:the y start coordinate of the line 
  * @param  y_end  :the x end   coordinate of the line 
  * @param  color  :the color of the line 
  * @retval none
  */
void lcd_draw_line(uint16_t x_start, uint16_t y_start, uint16_t x_end, uint16_t y_end,uint16_t color)
{
	u16 t; 
	int xerr=0,yerr=0,delta_x,delta_y,distance; 
	int incx,incy,uRow,uCol; 
	delta_x=x_end-x_start; 
	delta_y=y_end-y_start; 
	uRow=x_start; 
	uCol=y_start; 
	if(delta_x>0)incx=1; 
	else if(delta_x==0)incx=0;
	else {incx=-1;delta_x=-delta_x;} 
	if(delta_y>0)incy=1; 
	else if(delta_y==0)incy=0;
	else{incy=-1;delta_y=-delta_y;} 
	if( delta_x>delta_y)distance=delta_x; 
	else distance=delta_y; 
	for(t=0;t<=distance+1;t++ )
	{  
		lcd_point_draw(uRow,uCol,color);
		xerr+=delta_x ; 
		yerr+=delta_y ; 
		if(xerr>distance) 
		{ 
			xerr-=distance; 
			uRow+=incx; 
		} 
		if(yerr>distance) 
		{ 
			yerr-=distance; 
			uCol+=incy; 
		} 
	}  
}    

/**
  * @brief  read a pixel color value at a specified location
  * @param  x:the x coordinate of the pixel 
  * @param  y:the y coordinate of the pixel
  * @retval the read color value
  */
uint16_t lcd_point_read(uint16_t x, uint16_t y)
{
  uint16_t color;
  if(x >= lcddev.width || y >= lcddev.height)
  {
    return 0;
  }
  
  lcd_cursor_set(x, y);
  
  lcd_ram_prepare_read();
  
  color = lcd_data_16bit_read(); 
  
  return color;
}

/**
  * @brief  full screen filled lcd screen
  * @param  color:filled color
  * @retval none
  */
void lcd_clear(uint16_t color)
{
  uint32_t i; 
  
  uint32_t total_point = lcddev.width * lcddev.height;
  
  lcd_windows_set(0, 0, lcddev.width - 1, lcddev.height - 1);  
   
  
  for(i = 0 ;i < total_point; i++)
  { 
    #if LCD_USE8BIT_MODEL  
    LCD->LCD_RAM = color >> 8;
    LCD->LCD_RAM = color;
    #else
    *(__IO uint16_t*) XMC_LCD_DATA = color;
    #endif
  }
} 

/** 
  * @brief  initialization lcd screen
  * @param  direction: display direction
  *         this parameter can be one of the following values:
  *         - LCD_DISPLAY_VERTICAL: vertical display.
  *         - LCD_DISPLAY_HORIZONTAL: horizontal display.
  * @retval none
  */   
void lcd_init(lcd_display_type direction)
{
  xmc_init();
  LCD_RESET_HIGH();
  delay_ms(120);
  LCD_RESET_LOW();
  delay_ms(120);
  LCD_RESET_HIGH();
  delay_ms(120);
  
  lcd_reg_write(0xF7);
  lcd_data_write(0xA9);
  lcd_data_write(0x51);
  lcd_data_write(0x2C);
  lcd_data_write(0x82);

  lcd_reg_write(0xC0);
  lcd_data_write(0x11);
  lcd_data_write(0x09);

  lcd_reg_write(0xC1);
  lcd_data_write(0x41);

  lcd_reg_write(0xC5);
  lcd_data_write(0x00);
  lcd_data_write(0x0A);
  lcd_data_write(0x80);

  lcd_reg_write(0xB1);
  lcd_data_write(0xB0);
  lcd_data_write(0x11);

  lcd_reg_write(0xB4);
  lcd_data_write(0x02);

  lcd_reg_write(0xB6);
  lcd_data_write(0x02);
  lcd_data_write(0x22);

  lcd_reg_write(0xB7);
  lcd_data_write(0xc6);

  lcd_reg_write(0xBE);
  lcd_data_write(0x00);
  lcd_data_write(0x04);

  lcd_reg_write(0xE9);
  lcd_data_write(0x00);

  lcd_reg_write(0x36);
  lcd_data_write(0x08);

  lcd_reg_write(0x3A);
  lcd_data_write(0x55);

  lcd_reg_write(0xE0);
  lcd_data_write(0x00);
  lcd_data_write(0x07);
  lcd_data_write(0x10);
  lcd_data_write(0x09);
  lcd_data_write(0x17);
  lcd_data_write(0x0B);
  lcd_data_write(0x41);
  lcd_data_write(0x89);
  lcd_data_write(0x4B);
  lcd_data_write(0x0A);
  lcd_data_write(0x0C);
  lcd_data_write(0x0E);
  lcd_data_write(0x18);
  lcd_data_write(0x1B);
  lcd_data_write(0x0F);

  lcd_reg_write(0xE1);
  lcd_data_write(0x00);
  lcd_data_write(0x17);
  lcd_data_write(0x1A);
  lcd_data_write(0x04);
  lcd_data_write(0x0E);
  lcd_data_write(0x06);
  lcd_data_write(0x2F);
  lcd_data_write(0x45);
  lcd_data_write(0x43);
  lcd_data_write(0x02);
  lcd_data_write(0x0A);
  lcd_data_write(0x09);
  lcd_data_write(0x32);
  lcd_data_write(0x36);
  lcd_data_write(0x0F);

  lcd_reg_write(0x11);
  delay_ms(120);
  lcd_reg_write(0x29);
  delay_ms(120);

  lcd_direction(direction);
  delay_ms(120);
  LCD_BL_HIGH();   
  delay_ms(120);
  
  lcd_clear(RED);  
}

/**
  * @brief  setting lcd display window
  * @param  xstar:the bebinning x coordinate of the lcd display window
  * @param  ystar:the bebinning y coordinate of the lcd display window
  * @param  xend:the endning x coordinate of the lcd display window
  * @param  yend:the endning y coordinate of the lcd display window
  * @retval none
  */ 
void lcd_windows_set(uint16_t xstar, uint16_t ystar, uint16_t xend, uint16_t yend)
{  
  lcd_reg_write(lcddev.setxcmd);  
  lcd_data_write(xstar >> 8);
  lcd_data_write(0x00FF & xstar);    
  lcd_data_write(xend >> 8);
  lcd_data_write(0x00FF & xend);

  lcd_reg_write(lcddev.setycmd);  
  lcd_data_write(ystar >> 8);
  lcd_data_write(0x00FF & ystar);    
  lcd_data_write(yend >> 8);
  lcd_data_write(0x00FF & yend);

  lcd_ram_prepare_write();  
}   

/**
  * @brief  set coordinate value
  * @param  xpos:the  x coordinate of the pixel
  * @param  ypos:the  y coordinate of the pixel
  * @retval none
  */
void lcd_cursor_set(uint16_t xpos, uint16_t ypos)
{                
  lcd_windows_set(xpos, ypos, xpos, ypos);  
} 

/**
  * @brief  setting the display direction of lcd screen
  * @param  direction:0-0 degree
  *                   1-90 degree
  *                   2-180 degree
  *                   3-270 degree
  * @retval none
  */ 
void lcd_direction(uint8_t direction)
{ 
  lcddev.setxcmd = 0x2A;
  lcddev.setycmd = 0x2B;
  lcddev.wramcmd = 0x2C;
  lcddev.rramcmd = 0x2E;
  lcddev.dir = direction % 4;
  
  switch(lcddev.dir)
  {      
    case LCD_DISPLAY_HORIZONTAL:
      lcddev.width = LCD_H;
      lcddev.height = LCD_W;
      lcd_command_write(0x36, (1 << 3) | (1 << 6) | (1 << 5));
    break;
    case LCD_DISPLAY_VERTICAL:                    
      lcddev.width = LCD_W;
      lcddev.height = LCD_H;  
      lcd_command_write(0x36, (1 << 3) | (1 << 6) | (1 << 7));
    break;
    default:break;
  }    
}   

/**
  * @brief  read id
  * @param  none
  * @retval id value
  */ 
uint16_t lcd_id_read(void)
{
  uint8_t val[4] = {0};
  
  lcd_command_read(0xD3, val, 4);
  
