Qie-Zi-888/Multi_functionalMenu/libraries/at32f435_437_board/at32f435_437_board_lcd.c
  return (val[2] << 8) | val[3];
}

/**
  * @brief  this function is show char to lcd
  * @param  x : row coordinates starting vaule
  * @param  y : column coordinates starting vaule
  * @param  num : number of char
  * @param  size : size of char
  * @param  mode : color
  * @retval none
  */
void lcd_char_show(uint16_t x, uint16_t y, uint8_t num, uint8_t size, uint8_t mode)
{
  uint8_t temp, t1, t;
  uint16_t y0 = y;
  uint8_t csize = (size / 8 + ((size % 8) ? 1 : 0)) * (size / 2);
  num = num - ' ';

  for(t = 0; t < csize; t++)
  {
    if(size == 12)
    {
      temp = asc2_1206[num][t];
    }
    else if(size == 16)
    {
      temp = asc2_1608[num][t];
    }
    else if(size == 24)
    {
      temp = asc2_2412[num][t];
    }
    else if(size == 32)
    {
      temp = asc2_3216[num][t];
    }
    else
    {
      return;
    }

    for(t1 = 0; t1 < 8; t1++)
    {
      if(temp & 0x80)
      {
        lcd_point_draw(x, y, WHITE);
      }
      else if(mode == 0)
      {
        lcd_point_draw(x, y, BLACK);
      }

      temp <<= 1;
      y++;

      if(y >= LCD_H)
      {
        return;
      }

      if((y - y0) == size)
      {
        y = y0;
        x++;

        if(x >= LCD_W)
        {
          return;
        }

        break;
      }
    }
  }
}

/**
  * @brief  this function is show chinese to lcd
  * @param  x : row coordinates starting vaule
  * @param  y : column coordinates starting vaule
  * @param  gbk : chinese code
  * @param  size : size of char
  * @param  mode : color
  * @retval none
  */
void lcd_font_show(uint16_t x, uint16_t y, uint8_t *gbk, uint8_t size, uint8_t mode)
{
  uint32_t temp, t1, t, flag;
  uint16_t x0 = x;
  uint8_t buf[72];
  
  if(size == 24)
  {
    chinese_font_24x24_read(gbk, buf);
    flag = 0x00800000;
  }
  else
  {
    return;
  }
  
  for(t = 0; t < size; t++)
  {
    if(size == 24)
    {
      temp = (buf[t * 3 + 0] << 16) | (buf[t * 3 + 1] << 8) | buf[t * 3 + 2];
    }
    
    for(t1 = 0; t1 < size; t1++)
    {
      if(temp & flag)
      {
        lcd_point_draw(x, y, WHITE);
      }
      else if(mode == 0)
      {
        lcd_point_draw(x, y, BLACK);
      }
      
      temp <<= 1;
      
      x++; 
      
      if(x >= LCD_W)
      {
        return;
      }
    }
    
    x = x0;
    y++;
    
    if(y >= LCD_H)
    {
      return;
    }
  }
}

/**
  * @brief  this function is show string to lcd
  * @param  x : row coordinates starting vaule
  * @param  y : column coordinates starting vaule
  * @param  width : width of area
  * @param  height : height of area
  * @param  size : size of font
  * @param  p : pointer of string
  * @retval none
  */
void lcd_string_show(uint16_t x, uint16_t y, uint16_t width, uint16_t height, uint8_t size, uint8_t *p)
{
  width += x;
  height += y;

  while(*p)
  {
    if(x >= width)
    {
      break;
    }

    if(y >= height)
    {
      break;
    }

    if(*p < 127)
    {
      lcd_char_show(x, y, *p, size, BLACK);
      x += size / 2;
      p++;       
    }
    else
    {
      lcd_font_show(x, y, p, size, BLACK);
      x += size;
      p += 2;    
    }
  }
}

/**
  * @brief  this function is fill in lcd with concolorous
  * @param  sx : row coordinates starting vaule
  * @param  sy : column coordinates starting vaule
  * @param  ex : row coordinates ending vaule
  * @param  ey : column coordinates ending vaule
  * @param  color : color for fill in lcd
  * @retval none
  */
void lcd_fill(uint16_t sx, uint16_t sy, uint16_t ex, uint16_t ey, uint16_t color)
{
  uint16_t height, width;
  uint16_t i, j;

  width = ex - sx + 1;
  height = ey - sy + 1;
  
  lcd_windows_set(sx, sy, ex, ey);

  for(i = 0; i < height; i++)
  {
    for(j = 0; j < width; j++)
    {
      lcd_data_16bit_write(color);
    }
  }
}

/**
  * @brief  this function is fill in lcd with color-pointer
  * @param  sx : row coordinates starting vaule
  * @param  sy : column coordinates starting vaule
  * @param  ex : row coordinates ending vaule
  * @param  ey : column coordinates ending vaule
  * @param  color : color-point for fill in lcd
  * @retval none
  */
void lcd_color_fill(uint16_t sx, uint16_t sy, uint16_t ex, uint16_t ey, uint16_t *color)
{
  uint16_t height, width;
  uint16_t i, j;

  width = ex - sx + 1;
  height = ey - sy + 1;
  
  lcd_windows_set(sx, sy, ex, ey);

  for(i = 0; i < height; i++)
  {
    for(j = 0; j < width; j++)
    {
      lcd_data_16bit_write(color[i * width + j]);
    }
  }
}

/**
  * @brief  this function is show int number to lcd
  * @param  x : row coordinates starting vaule
  * @param  y : column coordinates starting vaule
  * @param  width : width of string
  * @param  height : height of string
  * @param  num : number
  * @retval num_bit : display number of digits
  */
void lcd_num_show(uint16_t x, uint16_t y, uint16_t width, uint16_t height, uint8_t size, int32_t num, uint8_t num_bit)
{           
  uint8_t i, buf[12], start;
  
  buf[11] = 0;
  
  if(num < 0)
  {
    num = -num;
    buf[0] = '-';
  }
  else
  {
    buf[0] = '0';
  }
  
  for(i = 0; i < 10; i++)
  {
    buf[10 - i] =  num % 10 + '0';
    num /= 10;
    
    if(buf[10 - i] > '0')
    {
      start = 10 - i;
    }
  }  
    
  if(buf[0] == '-')
  {
    start -= 1;
    
    buf[start] = '-';
  }
  else
  {
    if(start > (11 - num_bit))
    {
      start = 11 - num_bit;
    }  
  }

  lcd_string_show(x, y, width, height, size, &buf[start]);
} 

/**
  * @brief  this function is show float number to lcd
  * @param  x : row coordinates starting vaule
  * @param  y : column coordinates starting vaule
  * @param  width : width of string
  * @param  height : height of string
  * @param  num : number
  * @retval num_bit : display number of digits
  */
void lcd_float_num_show(uint16_t x, uint16_t y, uint16_t width, uint16_t height, uint8_t size, float num, uint8_t num_bit)
{           
  uint8_t buf[12];
  int32_t int_num;
  
  int_num = num;
  
  buf[0] = int_num + '0';

  num = num - int_num;
  
  num *= 1000;
  
  int_num = num;
  
  buf[1] = '.';
  buf[2] = (int_num / 100) + '0';
  buf[3] = (int_num % 100 / 10) + '0';
  buf[4] = (int_num % 10) + '0';
  buf[5] = 0;
  
  buf[num_bit + 2] = 0;
  
  lcd_string_show(x, y, width, height, size, buf);
} 
